name: "xyFSRCNN-s_subpixel_train_test"
layer {
  name: "data"
  type: "ImageData"
  top: "ImageData1"
  top: "ImageData2"
  include {
    phase: TRAIN
  }
  transform_param {
    scale: 0.00390625
  }
  image_data_param {
    source: "/root/e3s10/caffe-ssd/examples/xy_fsrcnn_s/640-360/subpixel/train.txt"
    batch_size: 1
    new_height: 360
    new_width: 640
    is_color: true
    root_folder: "/root/e3s10/caffe-ssd/examples/xy_fsrcnn_s/640-360/subpixel/"
  }
}
layer {
  name: "data"
  type: "ImageData"
  top: "ImageData1"
  top: "ImageData2"
  include {
    phase: TEST
  }
  transform_param {
    scale: 0.00390625
  }
  image_data_param {
    source: "/root/e3s10/caffe-ssd/examples/xy_fsrcnn_s/640-360/subpixel/test.txt"
    batch_size: 1
    new_height: 360
    new_width: 640
    is_color: true
    root_folder: "/root/e3s10/caffe-ssd/examples/xy_fsrcnn_s/640-360/subpixel/"
  }
}
layer {
  name: "label"
  type: "ImageData"
  top: "label1"
  top: "label2"
  include {
    phase: TRAIN
  }
  transform_param {
    scale: 0.00390625
  }
  image_data_param {
    source: "/root/e3s10/caffe-ssd/examples/xy_fsrcnn_s/640-360/subpixel/train_label.txt"
    batch_size: 1
    new_height: 720
    new_width: 1280
    is_color: true
    root_folder: "/root/e3s10/caffe-ssd/examples/xy_fsrcnn_s/640-360/subpixel/"
  }
}
layer {
  name: "label"
  type: "ImageData"
  top: "label1"
  top: "label2"
  include {
    phase: TEST
  }
  transform_param {
    scale: 0.00390625
  }
  image_data_param {
    source: "/root/e3s10/caffe-ssd/examples/xy_fsrcnn_s/640-360/subpixel/test_label.txt"
    batch_size: 1
    new_height: 720
    new_width: 1280
    is_color: true
    root_folder: "/root/e3s10/caffe-ssd/examples/xy_fsrcnn_s/640-360/subpixel/"
  }
}

layer {
  name: "conv1"
  type: "Convolution"
  bottom: "ImageData1"
  top: "Convolution1"
  param {
    lr_mult: 1
  }
  param {
    lr_mult: 2
  }
  convolution_param {
    num_output: 32
    pad: 1
    kernel_size: 5
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.0500000007451
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "relu1"
  type: "PReLU"
  bottom: "Convolution1"
  top: "Convolution1"
  prelu_param {
    channel_shared: true
  }
}
layer {
  name: "conv2"
  type: "Convolution"
  bottom: "Convolution1"
  top: "Convolution2"
  param {
    lr_mult: 1
  }
  param {
    lr_mult: 2
  }
  convolution_param {
    num_output: 5
    pad: 0
    kernel_size: 1
    group: 1
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.0500000007451
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "relu2"
  type: "PReLU"
  bottom: "Convolution2"
  top: "Convolution2"
  prelu_param {
    channel_shared: true
  }
}
layer {
  name: "conv22"
  type: "Convolution"
  bottom: "Convolution2"
  top: "Convolution3"
  param {
    lr_mult: 1
  }
  param {
    lr_mult: 2
  }
  convolution_param {
    num_output: 5
    pad: 1
    kernel_size: 3
    group: 1
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.0500000007451
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "relu22"
  type: "PReLU"
  bottom: "Convolution3"
  top: "Convolution3"
  prelu_param {
    channel_shared: true
  }
}
layer {
  name: "conv23"
  type: "Convolution"
  bottom: "Convolution3"
  top: "Convolution4"
  param {
    lr_mult: 1
  }
  param {
    lr_mult: 2
  }
  convolution_param {
    num_output: 32
    pad: 1
    kernel_size: 1
    group: 1
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.0500000007451
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "relu23"
  type: "PReLU"
  bottom: "Convolution4"
  top: "Convolution4"
  prelu_param {
    channel_shared: true
  }
}
layer {
  name: "conv3"
  type: "Convolution"
  bottom: "Convolution4"
  top: "Convolution5"
  param {
    lr_mult: 1
  }
  param {
    lr_mult: 2
  }
  convolution_param {
    num_output: 12
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.0500000007451
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "reshape_to_6d"
  type: "Reshape"
  bottom: "Convolution5"
  top: "Reshape1"
  reshape_param {
    shape {
      dim: 0
      dim: 2
      dim: 2
      dim: 3
      dim: 360
      dim: -1
    }
  }
}
layer {
  name: "permute"
  type: "Permute"
  bottom: "Reshape1"
  top: "Permute1"
  permute_param {
    order: 0
    order: 3
    order: 4
    order: 1
    order: 5
    order: 2
  }
}
layer {
  name: "reshape_to_4d"
  type: "Reshape"
  bottom: "Permute1"
  top: "Reshape2"
  reshape_param {
    shape {
      dim: 0
      dim: 3
      dim: 720
      dim: -1
    }
  }
}
layer {
  name: "loss"
  type: "EuclideanLoss"
  bottom: "Reshape2"
  bottom: "label1"
  top: "EuclideanLoss1"
}
